programming/20230305160421-cse_373_lecture_2.org
:PROPERTIES:
:ID:       aa2d6d49-ec3f-4662-b3fa-be5690652278
:END:
#+TITLE: CSE-373-lecture 2
#+SETUPFILE: /home/unseen/Documents/Notes/org/roam/org-setup.org

#+CREATED: [2023-03-05 Sun 16:04]
#+LAST_MODIFIED: [2023-03-05 Sun 16:26]
Note: this is on hole until i do more data struct stuff which seems to be referenced with the lectures
Video lecture: https://www.youtube.com/watch?v=z1mkCe3kVUA&list=PLOtl7M3yp-DX6ic0HGT0PUX_wiNmkWkXx&index=2
* The movie star problem :compsci::algo:

A movie star wants to select the maximum number of staring roles such that no two jobs needs him at two places.

there is a time shooting starts and shooting ends

** Solutions
*** Shortest Job first
Always do the shortest job first, so you do the least amount of work.
#+begin_src puesdo
ShortestJobFirst(I)
    While(I != 0) do
      accept the shortest possible job from I.
      Delete J and intervals which intersect j from i
#+end_src

If you are getting payed a million $ for a shoot might as well do the shortest one.

*** Reason why it wont work
Taking the shortest job could block to longer job that barley intersect and leaves you with less work.
