programming/20230305160421-cse_373_lecture_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-13 Thu 20:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CSE-373-lecture 2</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">CSE-373-lecture 2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb55e8a1">The movie star problem&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span>&#xa0;<span class=""></span>&#xa0;<span class="algo">algo</span></span></a>
<ul>
<li><a href="#org7a9c879">Solutions</a>
<ul>
<li><a href="#orgf0d7a8d">Shortest Job first</a></li>
<li><a href="#orgacaba94">Reason why it wont work</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Note: this is on hole until i do more data struct stuff which seems to be referenced with the lectures
Video lecture: <a href="https://www.youtube.com/watch?v=z1mkCe3kVUA&amp;list=PLOtl7M3yp-DX6ic0HGT0PUX_wiNmkWkXx&amp;index=2">https://www.youtube.com/watch?v=z1mkCe3kVUA&amp;list=PLOtl7M3yp-DX6ic0HGT0PUX_wiNmkWkXx&amp;index=2</a>
</p>
<div id="outline-container-orgb55e8a1" class="outline-2">
<h2 id="orgb55e8a1">The movie star problem&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span>&#xa0;<span class=""></span>&#xa0;<span class="algo">algo</span></span></h2>
<div class="outline-text-2" id="text-orgb55e8a1">
<p>
A movie star wants to select the maximum number of staring roles such that no two jobs needs him at two places.
</p>

<p>
there is a time shooting starts and shooting ends
</p>
</div>

<div id="outline-container-org7a9c879" class="outline-3">
<h3 id="org7a9c879">Solutions</h3>
<div class="outline-text-3" id="text-org7a9c879">
</div>
<div id="outline-container-orgf0d7a8d" class="outline-4">
<h4 id="orgf0d7a8d">Shortest Job first</h4>
<div class="outline-text-4" id="text-orgf0d7a8d">
<p>
Always do the shortest job first, so you do the least amount of work.
</p>
<div class="org-src-container">
<pre class="src src-puesdo">ShortestJobFirst(I)
    While(I != 0) do
      accept the shortest possible job from I.
      Delete J and intervals which intersect j from i
</pre>
</div>

<p>
If you are getting payed a million $ for a shoot might as well do the shortest one.
</p>
</div>
</div>

<div id="outline-container-orgacaba94" class="outline-4">
<h4 id="orgacaba94">Reason why it wont work</h4>
<div class="outline-text-4" id="text-orgacaba94">
<p>
Taking the shortest job could block to longer job that barley intersect and leaves you with less work.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
